<?php

namespace Database\Seeders;

use App\Models\Price;
use App\Models\Service;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Str;

class PriceSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [
            [
                'title' => 'Гигиена полости рта',
                'price' => 'от 4500 руб.',
                'link_service' => env('APP_URL') . '/uslugi/' . Service::where('title', 'Профилактика')->first()->slug,
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Профилактика')->first()->id
            ],
            [
                'title' => 'Клиническое отбеливание зубов. Система Opalescence',
                'price' => '14900 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Гигиена полости рта')->first()->id
            ],
            [
                'title' => 'Профессиональная гигиена полости рта и зубов на этапах ортодонтического лечения',
                'price' => '8000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Гигиена полости рта')->first()->id
            ],
            [
                'title' => 'Профессиональная гигиена полости рта и зубов на этапах ортодонтического лечения',
                'price' => '8000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Гигиена полости рта')->first()->id
            ],
            [
                'title' => 'Гигиена полости рта особой сложности',
                'price' => '8800 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Гигиена полости рта')->first()->id
            ],
            [
                'title' => 'Комплексная гигиена полости рта (2 челюсти: удаление цветного налета "AirFlow", снятие твердых зубных отложений ультразвуком, полировка)',
                'price' => '7000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Гигиена полости рта')->first()->id
            ],

            [
                'title' => 'Простое(молочные, подвижные зубы)',
                'price' => 'от 2000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Удаление зубов')->first()->id
            ],
            [
                'title' => 'Сложное (зубы мудрости, разрушенные зубы, корни)',
                'price' => 'от 7000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Удаление зубов')->first()->id
            ],

            [
                'title' => 'Осстем',
                'price' => 'от 29000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Одиночная')->first()->id
            ],
            [
                'title' => 'Штрауман',
                'price' => 'от 65000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Одиночная')->first()->id
            ],
            [
                'title' => 'All-in-4',
                'price' => 'от 250000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Тотальная реабилитация')->first()->id
            ],
            [
                'title' => 'Aii-in-6',
                'price' => 'от 300000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Тотальная реабилитация')->first()->id
            ],

            [
                'title' => 'Открытый',
                'price' => '55000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Верхняя челюсть. Синус-лифтинг')->first()->id
            ],
            [
                'title' => 'Закрытытй',
                'price' => '15000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Верхняя челюсть. Синус-лифтинг')->first()->id
            ],
            [
                'title' => 'НКР направление',
                'price' => '',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Нижняя Челюсть. Синус-лифтинг')->first()->id
            ],
            [
                'title' => 'Костная регенерация',
                'price' => '',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Нижняя Челюсть. Синус-лифтинг')->first()->id
            ],

            [
                'title' => 'Объём десны',
                'price' => '',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Пластика мягких тканей')->first()->id
            ],
            [
                'title' => 'Закрытие рецессиий',
                'price' => '',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Пластика мягких тканей')->first()->id
            ],
            [
                'title' => 'Увеличение преддверия',
                'price' => '',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Пластика мягких тканей')->first()->id
            ],
            [
                'title' => 'Cоздание',
                'price' => '',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Пластика мягких тканей')->first()->id
            ],

            [
                'title' => 'Лечение кариеса(простой, средний, сложный)',
                'price' => 'от 4500 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Лечение зубов')->first()->id
            ],
            [
                'title' => 'Лечение каналов(одноканальный, 2х, 3хканальный зуб)',
                'price' => 'от 9000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Эндодонтия')->first()->id
            ],

            [
                'title' => 'Навигационная имплантация',
                'price' => '',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Цифровая стоматология')->first()->id
            ],
            [
                'title' => 'Цифровое сканирование зубов',
                'price' => '5000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Цифровая стоматология')->first()->id
            ],

            [
                'title' => 'Коронка на имплант',
                'price' => '35000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Коронки')->first()->id
            ],
            [
                'title' => 'Коронка из диоксида циркония',
                'price' => '29000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Коронки')->first()->id
            ],
            [
                'title' => 'Коронка Е-maх',
                'price' => '35000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Виниры')->first()->id
            ],

            [
                'title' => 'Брекеты',
                'price' => 'от 350000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Ортодонтия')->first()->id
            ],
            [
                'title' => 'Элайнеры',
                'price' => 'от 400000 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Ортодонтия')->first()->id
            ],

            [
                'title' => 'ОПТГ (снимок 2челюсти)',
                'price' => '1500 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Диагностика')->first()->id
            ],
            [
                'title' => 'Прицельный снимок одного зуба',
                'price' => '500 руб.',
                'description' => 'Краткое описание технологии и процедуры. Краткое описание технологии и процедуры',
                'service_id' => Service::where('title', 'Диагностика')->first()->id
            ]

        ];

        foreach ($data as $key => $value) {
            Price::create($value);
        }
    }
}
