<?php

namespace Database\Seeders;

use App\Models\Question;
use App\Models\Review;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ReviewSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
            [
                'title' => 'Кульгавая Алла Вячеславовна',
                'description' =>'Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой! Спасибо врачу Айрапетян Р. Р., хороший доктор, дочке 3 года, нашла подход, прием прошел на ура, все почистили, ребенок не плакал, ушла с улыбкой!',
                'rating' => 5,
                'is_active' => 'on',
                'date' => '2023-06-30',
            ],
        ];

        foreach ($data as $key => $value) {
            Review::create($value);
        }
    }
}
