<?php

namespace Database\Seeders;

use App\Models\Specialist;
use App\Models\Specialization;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Str;

class SpecialistSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $data = [
            [
                'title' => 'Главный врач, хирург - имплантолог, ортопед, гнатолог',
                'slug' => Str::slug('Главный врач, хирург - имплантолог, ортопед, гнатолог'),
                'h1_title' => 'Мальков Сергей Николаевич.',
                'image' => 'specialists/1.jpg',
                'image_mob' => 'specialists/1-mob.jpg',
                'education' => '["\u0412\u044b\u0441\u0448\u0435\u0435 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435. \u041c\u043e\u0441\u043a\u043e\u0432\u0441\u043a\u0438\u0439 \u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439 \u043c\u0435\u0434\u0438\u043a\u043e-\u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442. \u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0441\u0442\u044c - \u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u044f","\u0412\u044b\u0441\u0448\u0435\u0435 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435. \u041c\u043e\u0441\u043a\u043e\u0432\u0441\u043a\u0438\u0439 \u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439 \u043c\u0435\u0434\u0438\u043a\u043e-\u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442. \u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0441\u0442\u044c - \u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u044f","\u0412\u044b\u0441\u0448\u0435\u0435 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435. \u041c\u043e\u0441\u043a\u043e\u0432\u0441\u043a\u0438\u0439 \u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439 \u043c\u0435\u0434\u0438\u043a\u043e-\u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442. \u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0441\u0442\u044c - \u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u044f"]',
                'operations' => '100+',
                'experience' => '23 года',
                'description' => 'Мальков Сергей Николаевич. Главный врач, хирург - имплантолог, ортопед, гнатолог. Стаж более 23 лет.',
                'og_title' => 'Мальков Сергей Николаевич.',
                'og_description' => 'Мальков Сергей Николаевич. Главный врач, хирург - имплантолог, ортопед, гнатолог. Стаж более 23 лет.',
                'og_url' => 'https://dr-malkov.ru/specialists/' . Str::slug('Главный врач, хирург - имплантолог, ортопед, гнатолог'),
                'meta_title' => 'Мальков Сергей Николаевич.',
                'meta_description' => 'Мальков Сергей Николаевич. Главный врач, хирург - имплантолог, ортопед, гнатолог. Стаж более 23 лет.',
                'meta_keywords' => 'Мальков Сергей Николаевич, хирург, имплантолог, ортопед, гнатолог',
            ],
            [
                'title' => 'Терапевт. Эндодонтист',
                'slug' => Str::slug('Терапевт. Эндодонтист'),
                'h1_title' => 'Дорошенко Владислава Сергеевна.',
                'image' => 'specialists/2.jpg',
                'image_mob' => 'specialists/2-mob.jpg',
                'education' => '["\u0412\u044b\u0441\u0448\u0435\u0435 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435. \u041c\u043e\u0441\u043a\u043e\u0432\u0441\u043a\u0438\u0439 \u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439 \u043c\u0435\u0434\u0438\u043a\u043e-\u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442. \u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0441\u0442\u044c - \u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u044f","\u0412\u044b\u0441\u0448\u0435\u0435 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435. \u041c\u043e\u0441\u043a\u043e\u0432\u0441\u043a\u0438\u0439 \u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439 \u043c\u0435\u0434\u0438\u043a\u043e-\u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442. \u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0441\u0442\u044c - \u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u044f","\u0412\u044b\u0441\u0448\u0435\u0435 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435. \u041c\u043e\u0441\u043a\u043e\u0432\u0441\u043a\u0438\u0439 \u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439 \u043c\u0435\u0434\u0438\u043a\u043e-\u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442. \u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0441\u0442\u044c - \u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u044f"]',
                'operations' => '100+',
                'experience' => '6 лет',
                'description' => 'Дорошенко Владислава Сергеевна. Терапевт. Эндодонтист. Стаж более 6 лет.',
                'og_title' => 'Дорошенко Владислава Сергеевна. Терапевт. Эндодонтист.',
                'og_description' => 'Дорошенко Владислава Сергеевна. Терапевт. Эндодонтист. Стаж более 6 лет.',
                'og_url' => 'https://dr-malkov.ru/specialist/' . Str::slug('Терапевт. Эндодонтист'),
                'meta_title' => 'Дорошенко Владислава Сергеевна. Терапевт. Эндодонтист.',
                'meta_description' => 'Дорошенко Владислава Сергеевна. Терапевт. Эндодонтист. Стаж более 6 лет.',
                'meta_keywords' => 'Дорошенко Владислава Сергеевна, терапевт, эндодонтист',
            ],
            [
                'title' => 'Терапевт. Микроскопист. Эндодонтист',
                'slug' => Str::slug('Терапевт. Микроскопист. Эндодонтист'),
                'h1_title' => 'Самвелян Рафаэль Лазаревич.',
                'image' => 'specialists/3.jpg',
                'image_mob' => 'specialists/3-mob.jpg',
                'education' => '["\u0412\u044b\u0441\u0448\u0435\u0435 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435. \u041c\u043e\u0441\u043a\u043e\u0432\u0441\u043a\u0438\u0439 \u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439 \u043c\u0435\u0434\u0438\u043a\u043e-\u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442. \u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0441\u0442\u044c - \u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u044f","\u0412\u044b\u0441\u0448\u0435\u0435 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435. \u041c\u043e\u0441\u043a\u043e\u0432\u0441\u043a\u0438\u0439 \u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439 \u043c\u0435\u0434\u0438\u043a\u043e-\u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442. \u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0441\u0442\u044c - \u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u044f","\u0412\u044b\u0441\u0448\u0435\u0435 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435. \u041c\u043e\u0441\u043a\u043e\u0432\u0441\u043a\u0438\u0439 \u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439 \u043c\u0435\u0434\u0438\u043a\u043e-\u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442. \u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0441\u0442\u044c - \u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u044f"]',
                'operations' => '100+',
                'experience' => '7 лет',
                'description' => 'Самвелян Рафаэль Лазаревич. Терапевт. Микроскопист. Эндодонтист. Стаж более 7 лет.',
                'og_title' => 'Самвелян Рафаэль Лазаревич. Терапевт. Микроскопист. Эндодонтист.',
                'og_description' => 'Стаж более 7 лет. 100+ операций. Звоните и записывайтесь на прием!',
                'og_url' => 'https://dr-malkov.ru/specialists/' . Str::slug('Терапевт. Микроскопист. Эндодонтист'),
                'meta_title' => 'Самвелян Рафаэль Лазаревич. Терапевт. Микроскопист. Эндодонтист.',
                'meta_description' => 'Стаж более 7 лет. 100+ операций. Звоните и записывайтесь на прием!',
                'meta_keywords' => 'Самвелян Рафаэль Лазаревич, терапевт, микроскопист, эндодонтист, стоматолог, стоматология, лечение зубов, Москва, клиника, стоматологическая клиника, записаться на прием, стоимость услуг, отзывы, контакты, адрес, телефон, email, график работы, спецалисты, специалист, врач, доктор',
            ],
            [
                'title' => 'Ортодонт',
                'slug' => Str::slug('Ортодонт'),
                'h1_title' => 'Макоев Азамат Борисович.',
                'image' => 'specialists/4.jpg',
                'image_mob' => 'specialists/4-mob.jpg',
                'education' => '["\u0412\u044b\u0441\u0448\u0435\u0435 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435. \u041c\u043e\u0441\u043a\u043e\u0432\u0441\u043a\u0438\u0439 \u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439 \u043c\u0435\u0434\u0438\u043a\u043e-\u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442. \u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0441\u0442\u044c - \u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u044f","\u0412\u044b\u0441\u0448\u0435\u0435 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435. \u041c\u043e\u0441\u043a\u043e\u0432\u0441\u043a\u0438\u0439 \u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439 \u043c\u0435\u0434\u0438\u043a\u043e-\u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442. \u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0441\u0442\u044c - \u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u044f","\u0412\u044b\u0441\u0448\u0435\u0435 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0435. \u041c\u043e\u0441\u043a\u043e\u0432\u0441\u043a\u0438\u0439 \u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439 \u043c\u0435\u0434\u0438\u043a\u043e-\u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u0447\u0435\u0441\u043a\u0438\u0439 \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442. \u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0441\u0442\u044c - \u0441\u0442\u043e\u043c\u0430\u0442\u043e\u043b\u043e\u0433\u0438\u044f"]',
                'operations' => '100+',
                'experience' => '8 лет',
                'description' => 'Макоев Азамат Борисович. Ортодонт. Стаж более 8 лет.',
                'og_title' => 'Макоев Азамат Борисович. Ортодонт',
                'og_description' => 'Стаж более 8 лет.',
                'og_url' => 'https://dr-malkov.ru/specialists/' . Str::slug('Ортодонт'),
                'meta_title' => 'Макоев Азамат Борисович. Ортодонт',
                'meta_description' => 'Стаж более 8 лет.',
                'meta_keywords' => 'Макоев Азамат Борисович, Ортодонт, стоматология',
            ]
        ];

        foreach ($data as $key => $value) {
            Specialist::create($value);
        }


    }
}
